Repository: EetuKaL/portfolio
Catalog: lib/l10n/*.arb
Languages: fi

# nav_about
source: About
fi: Tietoja

# nav_tools
source: Tools
fi: Työkalut

# nav_experience
source: Experience
fi: Kokemus

# nav_contact
source: Contact
fi: Yhteys

# hero_system
source: SYSTEM_ONLINE
fi: JÄRJESTELMÄ_KÄYNNISSÄ

# hero_role_1
source: Software Developer
fi: Ohjelmistokehittäjä

# hero_role_2
source: Flutter Specialist
fi: Flutter-asiantuntija

# hero_cta
source: Initiate Protocol
fi: Käynnistä Protokolla

# about_title
source: Who am I?
fi: Kuka olen minä?

# about_p1_prefix
source: I am a
fi: Olen Orivedeltä kotoisin oleva

# about_p1_highlight
source: Flutter-focused
fi: Flutter-painotteinen

# about_p1_suffix
source: software developer from Orivesi. My multi-disciplinary background has given me an unusually strong work ethic and a practical mindset.
fi: ohjelmistokehittäjä. Tulen moniammatillisesta taustasta, mikä on antanut minulle poikkeuksellisen vahvan työmoraalin ja käytännönläheisen asenteen.

# about_p2
source: I specialize in building scalable, modern applications. Previous roles taught me the value of architecture: I write code that is easy to understand and maintain.
fi: Erikoistun skaalautuvien ja modernien sovellusten rakentamiseen. Aikaisemmat työnantajani ovat opettaneet minulle arkkitehtuurin merkityksen: kirjoitan koodia, joka on helppo ymmärtää ja ylläpitää.

# stat_years
source: Years of experience
fi: Vuotta kokemusta

# stat_motivation
source: Motivation
fi: Motivaatio

# attr_title
source: Attributes
fi: Ominaisuudet

# attr_1_title
source: Practical:
fi: Käytännönläheinen:

# attr_1_body
source: Learning by doing and from mistakes.
fi: Oppiminen tekemällä ja virheistä.

# attr_2_title
source: Humble:
fi: Nöyrä:

# attr_2_body
source: I accept feedback and admit mistakes.
fi: Hyväksyn palautteen ja myönnän virheeni.

# attr_3_title
source: Motivated:
fi: Motivoitunut:

# attr_3_body
source: I know I am in the right field.
fi: Tiedän olevani oikealla alalla.

# skills_title
source: Tool stack
fi: Työkalupino

# experience_title
source: Experience
fi: Työhistoria

# exp1_task_1
source: Developed independently 100% remotely using modern technologies such as Flutter, AWS, Firebase, and Golang.
fi: Kehitin itsenäisesti 100% etänä käyttäen moderneja teknologioita kuten Flutter, AWS, Firebase ja Golang.

# exp1_task_2
source: UI/UX design in Figma using Material 3 principles.
fi: Käyttöliittymä- ja käyttökokemussuunnittelu Figmalla hyödyntäen Material 3 -periaatteita.

# exp1_task_3
source: Code quality ensured through thorough peer reviews.
fi: Koodin laatu varmistettiin tarkkojen vertaisarviointien kautta.

# exp2_task_1
source: Backend infrastructure with AWS Serverless (API Gateway, Lambda, Cognito, S3).
fi: Taustajärjestelmäinfrastruktuurin kehitys AWS:n palvelimettomilla palveluilla (API Gateway, Lambda, Cognito, S3).

# exp2_task_2
source: UI development with Flutter and React.
fi: Käyttöliittymien kehitys Flutterilla ja Reactilla.

# exp2_task_3
source: Worked within a Scrum model.
fi: Työskentely Scrum-mallin mukaisesti.

# education_title
source: Education
fi: Koulutus

# edu1_title
source: Fullstack Developer
fi: Täyden pinon kehittäjä

# edu2_title
source: Software Developer
fi: Ohjelmistokehittäjä

# contact_title
source: Get in touch
fi: Ota yhteyttä

# contact_email
source: Email
fi: Sähköposti

# contact_phone
source: Phone / 24/7
fi: Puhelin / 24/7

# contact_location
source: Location
fi: Sijainti

# footer_text
source: Designed for the future // Â© 2026 Eetu Kallioniemi
fi: Suunniteltu tulevaisuutta varten // © 2026 Eetu Kallioniemi

# aria_top
source: Back to top
fi: Palaa sivun alkuun
